# StructuralAttachmentEndValueRatio Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAttachmentEndValueRatio Property
ParameterTypeId Class See Also
---
"End attachment ratio"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAttachmentEndValueRatio { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAttachmentEndValueRatio As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAttachmentEndValueRatio {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace